###################################################################

# Created by write_sdc on Thu Apr 11 15:54:00 2024

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_model -name tsmc18_wl10 -library slow
set_max_area 0
set_driving_cell -lib_cell DFFX1 -library slow -pin Q [get_ports {X[7]}]
set_driving_cell -lib_cell DFFX1 -library slow -pin Q [get_ports {X[6]}]
set_driving_cell -lib_cell DFFX1 -library slow -pin Q [get_ports {X[5]}]
set_driving_cell -lib_cell DFFX1 -library slow -pin Q [get_ports {X[4]}]
set_driving_cell -lib_cell DFFX1 -library slow -pin Q [get_ports {X[3]}]
set_driving_cell -lib_cell DFFX1 -library slow -pin Q [get_ports {X[2]}]
set_driving_cell -lib_cell DFFX1 -library slow -pin Q [get_ports {X[1]}]
set_driving_cell -lib_cell DFFX1 -library slow -pin Q [get_ports {X[0]}]
set_driving_cell -lib_cell DFFX1 -library slow -pin Q [get_ports reset]
set_driving_cell -lib_cell BUFX4 -library slow -pin Y [get_ports clk]
set_load -pin_load 0.001913 [get_ports {Y[9]}]
set_load -pin_load 0.001913 [get_ports {Y[8]}]
set_load -pin_load 0.001913 [get_ports {Y[7]}]
set_load -pin_load 0.001913 [get_ports {Y[6]}]
set_load -pin_load 0.001913 [get_ports {Y[5]}]
set_load -pin_load 0.001913 [get_ports {Y[4]}]
set_load -pin_load 0.001913 [get_ports {Y[3]}]
set_load -pin_load 0.001913 [get_ports {Y[2]}]
set_load -pin_load 0.001913 [get_ports {Y[1]}]
set_load -pin_load 0.001913 [get_ports {Y[0]}]
set_max_fanout 6 [get_ports {X[7]}]
set_max_fanout 6 [get_ports {X[6]}]
set_max_fanout 6 [get_ports {X[5]}]
set_max_fanout 6 [get_ports {X[4]}]
set_max_fanout 6 [get_ports {X[3]}]
set_max_fanout 6 [get_ports {X[2]}]
set_max_fanout 6 [get_ports {X[1]}]
set_max_fanout 6 [get_ports {X[0]}]
set_max_fanout 6 [get_ports reset]
set_max_fanout 6 [get_ports clk]
set_max_transition 0.3 [get_ports {X[7]}]
set_max_transition 0.3 [get_ports {X[6]}]
set_max_transition 0.3 [get_ports {X[5]}]
set_max_transition 0.3 [get_ports {X[4]}]
set_max_transition 0.3 [get_ports {X[3]}]
set_max_transition 0.3 [get_ports {X[2]}]
set_max_transition 0.3 [get_ports {X[1]}]
set_max_transition 0.3 [get_ports {X[0]}]
set_max_transition 0.3 [get_ports reset]
set_max_transition 0.3 [get_ports clk]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_latency 1  [get_clocks clk]
set_clock_latency -source 0  [get_clocks clk]
set_clock_uncertainty 0.8  [get_clocks clk]
set_clock_transition -max -rise 0.5 [get_clocks clk]
set_clock_transition -max -fall 0.5 [get_clocks clk]
set_clock_transition -min -rise 0.5 [get_clocks clk]
set_clock_transition -min -fall 0.5 [get_clocks clk]
set_input_delay -clock clk  -max 1  [get_ports clk]
set_input_delay -clock clk  -min 0.2  [get_ports clk]
set_input_delay -clock clk  -max 1  [get_ports {X[7]}]
set_input_delay -clock clk  -min 0.2  [get_ports {X[7]}]
set_input_delay -clock clk  -max 1  [get_ports {X[6]}]
set_input_delay -clock clk  -min 0.2  [get_ports {X[6]}]
set_input_delay -clock clk  -max 1  [get_ports {X[5]}]
set_input_delay -clock clk  -min 0.2  [get_ports {X[5]}]
set_input_delay -clock clk  -max 1  [get_ports {X[4]}]
set_input_delay -clock clk  -min 0.2  [get_ports {X[4]}]
set_input_delay -clock clk  -max 1  [get_ports {X[3]}]
set_input_delay -clock clk  -min 0.2  [get_ports {X[3]}]
set_input_delay -clock clk  -max 1  [get_ports {X[2]}]
set_input_delay -clock clk  -min 0.2  [get_ports {X[2]}]
set_input_delay -clock clk  -max 1  [get_ports {X[1]}]
set_input_delay -clock clk  -min 0.2  [get_ports {X[1]}]
set_input_delay -clock clk  -max 1  [get_ports {X[0]}]
set_input_delay -clock clk  -min 0.2  [get_ports {X[0]}]
set_input_delay -clock clk  -max 1  [get_ports reset]
set_input_delay -clock clk  -min 0.2  [get_ports reset]
set_output_delay -clock clk  -max 1  [get_ports {Y[9]}]
set_output_delay -clock clk  -min 0.1  [get_ports {Y[9]}]
set_output_delay -clock clk  -max 1  [get_ports {Y[8]}]
set_output_delay -clock clk  -min 0.1  [get_ports {Y[8]}]
set_output_delay -clock clk  -max 1  [get_ports {Y[7]}]
set_output_delay -clock clk  -min 0.1  [get_ports {Y[7]}]
set_output_delay -clock clk  -max 1  [get_ports {Y[6]}]
set_output_delay -clock clk  -min 0.1  [get_ports {Y[6]}]
set_output_delay -clock clk  -max 1  [get_ports {Y[5]}]
set_output_delay -clock clk  -min 0.1  [get_ports {Y[5]}]
set_output_delay -clock clk  -max 1  [get_ports {Y[4]}]
set_output_delay -clock clk  -min 0.1  [get_ports {Y[4]}]
set_output_delay -clock clk  -max 1  [get_ports {Y[3]}]
set_output_delay -clock clk  -min 0.1  [get_ports {Y[3]}]
set_output_delay -clock clk  -max 1  [get_ports {Y[2]}]
set_output_delay -clock clk  -min 0.1  [get_ports {Y[2]}]
set_output_delay -clock clk  -max 1  [get_ports {Y[1]}]
set_output_delay -clock clk  -min 0.1  [get_ports {Y[1]}]
set_output_delay -clock clk  -max 1  [get_ports {Y[0]}]
set_output_delay -clock clk  -min 0.1  [get_ports {Y[0]}]
